#+BEGIN_HTML
---
layout: post
title: Python
tagline: " standard library disclosure"
permalink: /python/tdd/stdlib.html
categories: [python, TDD]
tags: [tutorial, stdlib, testing]
---
#+END_HTML
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t

#+TOC: headlines 2

* Preamble

* Methodology

** Template
   Lets create a mold for pouring by the test suits:
   
   #+BEGIN_SRC python :noweb yes :tangle tests/test_built-in_constants.py
   """Discover how it works by testing"""
   <<import-header>>


   <<built-in-constants-test>>

   <<second-test-class>>

   <<third-test-class>>
   #+END_SRC

   #+RESULTS:
   : Discover how it works by testing it all

** Necessary imports
   #+NAME: import-header
   #+BEGIN_SRC python
   import unittest
   #+END_SRC

** Test suits
   #+NAME: built-in-constants-test
   #+BEGIN_SRC python
     class TestBuiltInConstants(unittest.TestCase):

         def test_true(self):
             self.assertTrue(1 + 3 == 4)

         def test_false(self):
             self.assertFalse(1 + 4 == 4)

         def test_none(self):
             value = None
             self.assertIsNone(value)
   #+END_SRC

   #+RESULTS: first-test-class
   : None

   #+NAME: second-test-class
   #+BEGIN_SRC python
  
   #+END_SRC

   #+NAME: third-test-class
   #+BEGIN_SRC python
  
   #+END_SRC

** Test runner
   #+BEGIN_SRC sh :results output :exports both
     python -m unittest -v tests/test_built-in_constants.py 2>&1

   #+END_SRC

   #+RESULTS:
   : test_false (tests.test_built-in_constants.TestBuiltInConstants) ... ok
   : test_none (tests.test_built-in_constants.TestBuiltInConstants) ... ok
   : test_true (tests.test_built-in_constants.TestBuiltInConstants) ... ok
   : 
   : ----------------------------------------------------------------------
   : Ran 3 tests in 0.001s
   : 
   : OK

